---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintY
source: html/4075e1db-d094-94ec-1426-5b4f20d805a1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintY Property

"Y Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryLinearRestraintY { get; }
```